{"title": "Edwin Feulner, Heritage Foundation’s ‘George Washington,’ Dies at 83", "newspaper": "The New York Times", "url": "https://www.nytimes.com/2025/07/20/obituaries/edwin-feulner-dead.html", "archive_url": "https://web.archive.org/web/20250721195433/https://www.nytimes.com/2025/07/20/obituaries/edwin-feulner-dead.html", "publish_date": "2025-07-20T23:49:44Z", "writers": "By Alex Traub", "content": "Edwin J. Feulner Jr., a former right-wing congressional aide who felt himself in the ideological “wilderness” in the 1970s, but who, as the co-founder of the Heritage Foundation and its leader for most of its existence, became one of the most influential figures of a resurgent conservative movement, died on Friday. He was 83.\nThe Heritage Foundation announced his death in a statement that did not specify the cause or say where he died.\nMr. Feulner (pronounced FULL-ner) created Heritage with a friend, Paul Weyrich, in 1973. They wanted to go beyond informing public debate, as other think tanks did at the time, to influencing votes on legislation. Heritage would produce its work before big bills were introduced in Congress and distill its findings into easily digestible blurbs, called “backgrounders,” for harried politicians and their aides.\nMr. Weyrich went on to found several other conservative groups. Mr. Feulner ran Heritage from 1977 until 2013, and he became interim head again for a brief period in 2017. Two years ago, during a 50th anniversary celebration at Mount Vernon, the organization’s current president, Kevin Roberts, called Mr. Feulner “the Heritage Foundation’s George Washington.”\nAs Mr. Feulner described it, the foundational principles of Heritage included “free enterprise, limited government, individual freedom, traditional values and a strong national defense.”\nThe group was in the news during the last presidential election, when Kamala Harris and other Democrats argued that a Heritage document called Project 2025 would become a shadow agenda for Donald Trump’s second term. Mr. Trump sought to disassociate himself from the nearly 900-page list of policies, which included doctrinaire right-wing positions on such politically delicate subjects as abortion.\nWhat rarely came up during the public debate is how Project 2025 belonged to a long tradition of striking success that Heritage has enjoyed in shaping Republican presidential administrations.\nThe document was the latest iteration of the Mandate for Leadership, a wish list for new presidents that Heritage has issued around election cycles since Ronald Reagan took power in 1981.\nMr. Feulner explained how the tradition got started in Project 2025’s afterword, which he wrote, titled “Onward!”\nIn the fall of 1979, senior officials of the Nixon and Ford administrations, William E. Simon and Jack Eckerd, told Mr. Feulner that on assuming office they had received no practical guidance on how to institute conservative policies on issues like free markets, government size and national security. They added that their briefings came from liberal predecessors or career civil servants who favored the status quo.\nMr. Feulner and others at Heritage were early supporters of Ronald Reagan. Long before he beat Jimmy Carter in the 1980 election, Heritage decided to spend $250,000 to put together a guidebook for a Reagan presidency. The result, at 1,093 pages, was distributed by Mr. Reagan at his first cabinet meeting.\nMr. Feulner described the document to The Washington Post in 1983 as “the nuts and bolts of how you make the kind of changes that philosophers and academics have been talking about.” Heritage soon reported that about 60 percent of its suggestions had been acted on by the new administration in its first year in power.\nThe foundation was generally a booster of Republicans, but also saw its mandate as condemning Republicans when they failed to live up to principle.\nIn 1987, after Mr. Reagan signed an arms control agreement with the Soviet Union and praised reforms undertaken by its leader at the time, Mikhail S Gorbachev, Mr. Feulner told The New York Times that conservatives felt that “Ronald Reagan walked away from them in the end.” He was harsher still on George H.W. Bush, whose tax increases constituted a cardinal sin to conservatives.\nSoon after George W. Bush assumed office in 2001, Mr. Feulner dispensed the ultimate praise. “More Reaganite than the Reagan administration,” he told The Times. He added that he and Karl Rove, Mr. Bush’s top political adviser, spoke a couple of times a week.\nA new measure of the power of the Heritage Foundation came in 2013, when Jim DeMint, a Republican senator from South Carolina, resigned in order to succeed Mr. Feulner.\n“There’s no question in my mind that I have more influence now on public policy than I did as an individual senator,” Mr. DeMint told NPR in 2013.\nMr. DeMint was associated with the Tea Party, which Heritage had helped to finance and organize and which was a major force behind the Republican wave in the 2010 midterm elections. During the 2016 presidential campaign, as other members of the Republican establishment turned against Donald J. Trump, Mr. DeMint pursued a collaborative relationship with the Trump campaign.\nWhen Mr. Trump won, Mr. Feulner became head of domestic policy for the incoming president’s transition team. Heritage was ready with a database of thousands of loyal conservatives to appoint to political offices.\n”By betting long odds on Trump, he succeeded,” Daniel Drezner, then a columnist at The Washington Post, wrote of Mr. DeMint. “Heritage has easily been the most influential think tank in the Trump era.”\nIn 2017, during a White House dinner for grass roots leaders of the conservative movement, Mr. Feulner was the only think tank official invited — and he sat next to Mr. Trump.\n“In some respects, Trump the nonpolitician has an incredible advantage, even over Ronald Reagan,” Mr. Feulner told The Times in 2018. Mr. Reagan “knew there were certain things government couldn’t do,” he continued. Mr. Trump, on the other hand, has had a different mentality: “Hell, why can’t we do that? Let’s try it.”\nEdwin John Feulner Jr. was born in Chicago on Aug. 12, 1941. His father was a self-made success in real estate, getting a college degree in night school and later helping to develop downtown Chicago. His mother, Helen (Franzen) Feulner, doted on Eddie, the eldest son, as her favorite, his three younger sisters later told Lee Edwards, the author of the biography “Leading the Way: The Story of Ed Feulner and the Heritage Foundation.”\nHe grew up saying grace before meals and serving as an altar boy at a local Roman Catholic church.\nIn 1963, he earned a bachelor’s degree in English and business from Regis University, a Jesuit institution in Denver. While there, he experienced an ideological awakening while reading Russell Kirk’s book “The Conservative Mind” and Erik von Kuehnelt-Leddihn’s “Liberty or Equality.”\nIn his spare time in Washington,Mr. Feulner studied by correspondence for a Ph.D. in political science from the University of Edinburgh. He earned the degree in 1981.\nAs a young man, he was an aide to two Republican members of the House of Representatives: Melvin Laird of Wisconsin and Philip Crane of Illinois. (Mr. Laird went on to serve as secretary of defense in the Nixon administration.)\nThe Heritage Foundation was launched by a $260,000 donation from the beer baron Joseph Coors. Richard Mellon Scaife, the banking and oil scion, became another major early donor. But wary of charges that Heritage was a tool of a few rich men, Mr. Feulner built a substantial membership list with the help of Richard Viguerie, a conservative marketer.\nBy 1984, The Washington Post described Heritage’s annual budget of over $10 million as “the biggest of any think tank in Washington, left or right.” In 2023, its revenue was $101 million. The Times reported that Mr. Feulner’s 2010 salary was $1,098,612.\nIn 2005, The Washington Post found that Heritage swerved from criticizing the government of Malaysia to praising it around the time that a Hong Kong consulting firm co-founded by Mr. Feulner and advised by his wife, Linda Feulner, began representing Malaysian companies. In a statement, the Heritage Foundation denied that its reports were influenced by Feulner family business interests or any other external factor.\nMr. Feulner’s survivors include his wife; his children, Edwin III and Emily V. Lown; and several grandchildren.\nFlush with power in 1984, Mr. Feulner told The Times about the value of political irrelevance.\n“The years in the wilderness gave us the time to work out challenges to the prevailing orthodoxy,” he said. He saw “intellectual ferment” happening on the left — new ideas, new institutional energy. “Now we are in the mainstream,” he cautioned, “and we will suffer for that like the liberals before us.”"}
{"title": "Brother of Pat Tillman Crashes Into San Jose Post Office", "newspaper": "The New York Times", "url": "https://www.nytimes.com/2025/07/20/us/san-jose-post-office-crash.html", "archive_url": "https://web.archive.org/web/20250721195459/https://www.nytimes.com/2025/07/20/us/san-jose-post-office-crash.html", "publish_date": "2025-07-20T23:42:04Z", "writers": "By Bernard Mokam, Sonia A. Rao and Rick Rojas", "content": "A brother of Pat Tillman, the former professional football player killed while serving in Afghanistan, was arrested on Sunday after crashing a vehicle into a post office in San Jose, Calif., the authorities said.\nNo one was injured, but the crash set the building on fire, and the Postal Inspection Service said in a statement that it was “investigating the incident as a potentially intentional act.” The vehicle’s driver, Richard Tillman, 44, was being held on Monday at the Santa Clara County jail. He is charged with arson and vandalism and is scheduled for arraignment on Wednesday, a spokesperson for the sheriff’s office said.\nThe Tillman family confirmed on Monday that Mr. Tillman is the youngest brother of Pat Tillman, a star defensive back for the Arizona Cardinals who left the team to enlist in the U.S. Army after the Sept. 11, 2001, terrorist attacks. He was killed by friendly fire.\nRelatives said they believed the crash reflected Richard Tillman’s long emotional struggle. “It’s no secret that Richard has been battling severe mental health issues for many years,” his other brother, Kevin Tillman, wrote on Monday in a text message to The New York Times.\nMatt Mahan, the mayor of San Jose, also acknowledged that mental health issues could have been a factor in what he described as a “senseless act of destruction.”\n“Criminal acts require accountability,” Mr. Mahan said in a statement on Sunday, “but we also need to commit ourselves to expanding behavioral health treatment and intervening earlier in California to reduce the likelihood that situations like this transpire.”\nPat Tillman stepped away from a multimillion-dollar football career to become an Army Ranger. Richard Tillman, along with other relatives, publicly challenged the official account of his brother’s death in 2004. Military officials originally claimed that Pat Tillman had been shot by Afghan militants before disclosing that he had been killed by friendly fire.\nKevin Tillman, Richard’s brother, also served in Afghanistan as an Army Ranger.\nRichard Tillman appeared in a documentary directed by Amir Bar-Lev detailing the family’s exhaustive efforts to reveal a more complicated story of Pat Tillman’s life and death, as well as their anger with military officials.\nRichard Tillman has also worked as an actor, with a series of small roles in movies and on television, as a stand-up comedian and as the author of children’s books.\nJosef Cannon, an actor, writer and friend of Mr. Tillman, said that he was “stunned” to learn of the arrest. The two met around 2008 and bonded as artists, as well as over shared trauma, said Mr. Cannon, who advocated for legislative action after his daughter was abducted by his ex-wife.\nMr. Cannon said that he had last spoken with Mr. Tillman by phone a couple of years ago and had not been aware of his recent personal turmoil.\n“I never saw that side of him,” Mr. Cannon said. He added, “The Richard Tillman that I know — good people, good heart.”\nKevin Tillman said his family felt frustrated and helpless as Richard battled mental illness. He began posting statements and videos on social media that displayed behavior they found unsettling, Kevin said in a text message.\nRichard referred to himself as the “second coming,” and in one video, he alluded to living in his car, his belongings visibly piled up on the back seat behind him.\n“Securing the proper care and support for him has proven incredibly difficult, or rather, impossible,” Kevin Tillman said. “As a result, none of this is as shocking as it should be.”\nLivia Albeck-Ripka contributed reporting. Susan C. Beachy and Sheelagh McNeill contributed research."}
{"title": "Man Charged in Death of Daughter, 9, Reported Missing in Northern New York", "newspaper": "The New York Times", "url": "https://www.nytimes.com/2025/07/20/nyregion/missing-girl-amber-alert-lake-george.html", "archive_url": "https://web.archive.org/web/20250721195525/https://www.nytimes.com/2025/07/20/nyregion/missing-girl-amber-alert-lake-george.html", "publish_date": "2025-07-20T23:17:04Z", "writers": "By Johnny Diaz and Christine Hauser", "content": "A man who reported his 9-year-old daughter missing in Northern New York over the weekend was charged with murder on Monday, a day after her body was found, the State Police said.\nThe authorities on Sunday found the body of the girl, Melina Galanis Frattolin, of Canada, in Ticonderoga, N.Y., the New York State Police said in a statement.\nForest rangers found her body in a shallow portion of a pond, Capt. Robert McConnell of the New York State Police said at a news conference on Monday.\nThe State Police said that her father, Luciano Frattolin, 45, of Canada, had been charged with second-degree murder and concealment of a corpse.\nHe was arraigned on Monday in the Town of Ticonderoga Court. Mr. Frattolin, represented by a public defender, entered a plea of not guilty and was remanded to Essex County Jail ahead of a court hearing on Friday.\nCourt records said that he had concealed his daughter’s body under a log. The records and the police did not offer details about a motive.\nThe authorities did not elaborate on a cause of death or say where specifically the girl was found in Ticonderoga, which is in Essex County, N.Y., and about 100 miles north of Albany.\nMr. Frattolin had fabricated the report that his daughter had possibly been abducted near Exit 22 of Interstate 87 in Lake George, N.Y., around 10 p.m. on Saturday, the police said.\nHe told investigators that, as he stopped to relieve himself, his daughter went missing from their car, possibly abducted by occupants of a white van.\nCaptain McConnell said that the girl and her father, both residents of Montreal, had entered the United States legally on July 11 for a vacation, during which they visited New York and Connecticut.\nThe girl was seen on video surveillance at about 5:30 p.m. on Saturday at a restaurant in Saratoga Springs, N.Y., and then told her mother by telephone at 6:30 p.m. that she was on her way back to Canada. \nMelina, who lived full time with her mother in Montreal, appeared to be in good health and did not indicate she was under any duress at the time of the call, the police said.\nThe State Police said in a statement that Melina was killed at some point after her phone call with her mother and before her father’s 911 call about her being missing.\n“No evidence has been located to support the reports from Frattolin of an abduction involving a suspicious white van in the area of the alleged disappearance,” the police said.\nThe State Police said in a statement that “as the case progressed, law enforcement identified inconsistencies in the father’s account of events and the timeline he provided.”\nThe girl’s body was found about 38 miles north of Lake George, a popular summertime tourist destination in the state’s Adirondack region, about 200 miles north of New York City.\nA website for Mr. Frattolin’s business described him as an entrepreneur and founder of Gambella Coffee, and someone who “spends as much time as he can in Montreal, Canada with his beautiful daughter Melina.” The company’s website was taken down on Monday."}
{"title": "How Did the Number of People Missing After Texas Floods Drop So Drastically?", "newspaper": "The New York Times", "url": "https://www.nytimes.com/2025/07/20/us/texas-floods-missing.html", "archive_url": "https://web.archive.org/web/20250721195747/https://www.nytimes.com/2025/07/20/us/texas-floods-missing.html", "publish_date": "2025-07-20T22:47:22Z", "writers": "By Rick Rojas", "content": "In the swirl of anguish and uncertainty that followed the devastating floods in Central Texas, one of the most confounding elements of the aftermath was why there were so many people still missing weeks after the disaster. Where were they? Who were they? What happened to them?\nLast week, state and local officials said there were 97 people missing in Kerr County, which sustained the worst of the July 4 floods in the Hill Country. But then, on Saturday, they released a revised figure: three. The death toll there remained unchanged; the county had 107 of the 135 deaths recorded statewide.\nThe drop was substantial, yet it was not entirely unexpected, according to officials and those familiar with the rhythms of deadly natural disasters.\nThe fluctuation was a reflection of the chaos unleashed by a disaster of this magnitude and of the methodical work — sometimes painstaking to the point of frustration — required to bring clarity to the confusion. Whether in flash floods, wildfires or tornadoes, making sense of the list of the missing is a crucial part of the official response.\n“This process takes time,” Officer Jonathan Lamb of the police department in Kerrville, the county seat of Kerr County, said in a statement on Sunday, shedding some light on such an abrupt and drastic change. “It is essential to ensure that every lead is thoroughly followed and each person is properly accounted for.”\nLast week, when 97 were thought to be missing in Kerr County, Gov. Greg Abbott of Texas cautioned residents not to assume that being counted as missing necessarily meant that the person had died in the flood.\n“There’s no certainty that all 97 of those people were swept away by the storm,” the governor said on Monday.\nA wall of water descended on communities along the Guadalupe River before sunrise on July 4, and, in the resulting panic and turmoil, local officials urged people to report those believed to be missing to a telephone hotline and an email address. That figure quickly soared into the hundreds.\nMany had indeed been carried away by the surge of water, and the death toll climbed considerably in the following days. The missing also included people whose status was wrongly characterized in the turbulent aftermath. The situation was further complicated by the number of people who were visiting the area, which is popular with tourists, for the holiday weekend; their relatives and friends were reaching out to officials from afar.\nCorrecting the record took a deliberate effort. In the statement on Sunday, state and local officials described an “exhaustive” undertaking to verify the status of each individual who had been reported missing.\n“We understand how critical it is to report this information accurately,” Officer Lamb said, “not only for the families affected but for the integrity of our emergency response as a whole.”\nSuch a precipitous drop in the number of missing people is not all that unusual after a major disaster.\nIn the 2018 wildfire that ravaged Paradise, Calif., the number of people who were unaccounted for had climbed to around 1,300, though the final death toll was 85. After the 2023 fire in Maui, Hawaii, some 1,100 people were reported missing, but roughly six months later there were just two, with 102 confirmed deaths.\nThe number of missing in the Maui fire at one point fell to 388, and the authorities released a list of names. Some people were surprised to find themselves on it. They had lost nearly everything in the fire, some said — but not their lives.\n“People always want to draw a correlation between the number of people that haven’t been accounted for and the number of deaths,” Kory L. Honea, the sheriff of Butte County, Calif., said in 2023, reflecting on his experience responding to the Paradise fire. But he said that it was not fair to reach that conclusion too early. \nOn Sunday, officials in Kerr County acknowledged the relief from the steep decline, a rare sensation these days after an unrelenting torrent of heartache and loss.\nBut Officer Lamb said the work was not complete: The loved ones of three people were still waiting."}
{"title": "Off-Duty Customs Officer Shot in Robbery Attempt in Park, N.Y.P.D. Says", "newspaper": "The New York Times", "url": "https://www.nytimes.com/2025/07/20/nyregion/customs-officer-shooting-migrant-nyc.html", "archive_url": "https://web.archive.org/web/20250721195812/https://www.nytimes.com/2025/07/20/nyregion/customs-officer-shooting-migrant-nyc.html", "publish_date": "2025-07-20T22:24:58Z", "writers": "By Ana Ley", "content": "An off-duty customs officer was shot in the face and arm during a robbery attempt at a park in Manhattan late Saturday night, police officials said.\nThe officer, 42, was sitting with a friend on rocks at the water’s edge along the Hudson River in Upper Manhattan just before midnight when two men rode up on a scooter, Jessica Tisch, the police commissioner, said at a news conference Sunday afternoon. When one of the men approached the officer and revealed a firearm, the officer realized he was being robbed and drew his service weapon, Commissioner Tisch said. The robber fired his weapon first, and the two men exchanged gunfire, she said.\nThe robber was also shot and limped back to the scooter, and he fled the scene with his companion, Commissioner Tisch said, adding that the attack was captured by security cameras.\nThe commissioner said there was no indication that the officer, whom the police have not named, had been targeted for his employment. He is expected to recover from his injuries.\nThe police have detained Miguel Francisco Mora Nunez, 21, as a person of interest in relation to the shooting, Commissioner Tisch said. Mr. Mora walked into a hospital in the Bronx shortly after the attempted robbery with gunshot wounds to the groin and the leg, she said, which were consistent with the injuries sustained by the man who shot the officer as captured on video. Mr. Mora underwent surgery and is in custody at Lincoln Hospital, and he is expected to be arrested on Sunday, Commissioner Tisch said. The police are looking for his accomplice in the shooting, who has not been identified.\nOfficials said that Mr. Mora entered the United States illegally in 2023 through Arizona. He was arrested twice previously on domestic violence charges in New York, and officials had issued an arrest warrant after he failed to show up to a court date in one of those cases, Commissioner Tisch said on Sunday. Mr. Mora is also wanted in connection with a robbery in December and a stabbing in January, both of which occurred in the Bronx, as well as a pawnshop robbery in Massachusetts in February in which guns were stolen, the commissioner said.\nWe are having trouble retrieving the article content.\nPlease enable JavaScript in your browser settings.\nThank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or subscribe for all of The Times.\nThank you for your patience while we verify access.\nAlready a subscriber? Log in.\nWant all of The Times? Subscribe."}
{"title": "Flat-Bottomed Boat", "newspaper": "The New York Times", "url": "https://www.nytimes.com/2025/07/20/crosswords/daily-puzzle-2025-07-21.html", "archive_url": "https://web.archive.org/web/20250721200418/https://www.nytimes.com/2025/07/20/crosswords/daily-puzzle-2025-07-21.html", "publish_date": "2025-07-20T22:00:04Z", "writers": "By Sam Corbin", "content": "Jump to: Today’s Theme | Tricky Clues\nMONDAY PUZZLE — Despite the agreed-upon difficulty curve of the New York Times Crossword, which is meant to feel more challenging as the week goes on, I hardly ever go into a puzzle knowing exactly how tough it’s going to be for me to solve. Some Wednesdays feel like Saturdays. And some Saturdays feel like Tuesdays. These inconsistencies may have to do with the grids themselves or, perhaps, with the number of brain cells that decided to come to work with me that day.\nFor whatever reason, Monday puzzles are exempt from such ambiguity. Mondays are reliably breezy; Mondays are dependable! I’d trust a Monday to watch my laptop while I went to the bathroom. Today’s crossword, constructed by Katy Steinmetz and Rich Katz, is as delightful as I expected it to be. May it brace us all for the uncertainty of the solving week ahead.\nWhether or not you recognized the [Slogan for the Pokémon franchise] alluded to at 58A, I hope you can appreciate why, as the revealer clue suggests, it’s [also appropriate for 16-, 21-, 38- and 50-Across?]: You GOTTA CATCH ’EM ALL, using different definitions of the term “catch.”\nYou've definitely gotta catch [Successful throws to the end zone] in football, which are TOUCHDOWN PASSES (16A). Make sure you catch the [Regular 6 p.m. broadcast of daily events], as in the EVENING NEWS (21A). Taking a flight? Catch one of those [Vans from hotels to terminals and back], also known as AIRPORT SHUTTLES (38A). And while proofreading, you’ll have to catch the SPELLING ERRORS (50A) hinted at by my favorite clue in today’s puzzle: [Their are fore of them hear in this sentance].\n4A. Whenever I encounter the clue [What an angry customer may leave], my brain wants it to solve to “bad review,” but the entry is more about what the customer doesn’t leave. The answer is NO TIP.\nWe are having trouble retrieving the article content.\nPlease enable JavaScript in your browser settings.\nThank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or subscribe for all of The Times.\nThank you for your patience while we verify access.\nAlready a subscriber? Log in.\nWant all of The Times? Subscribe."}
{"title": "Should ICE Agents Be Allowed to Wear Masks? It Depends Whom You Ask.", "newspaper": "The New York Times", "url": "https://www.nytimes.com/2025/07/20/us/politics/ice-agents-masks.html", "archive_url": "https://web.archive.org/web/20250721210626/https://www.nytimes.com/2025/07/20/us/politics/ice-agents-masks.html", "publish_date": "2025-07-20T21:51:30Z", "writers": "By Alyce McFadden", "content": "Immigration raids by masked federal agents have helped create a “reign of terror” in Los Angeles, Mayor Karen Bass said in an interview aired Sunday on ABC.\nFear of arrest and deportation has prompted many of Southern California’s immigrants — no matter their legal status — to hunker down in their homes, missing work, forgoing church services and skipping milestones like children’s graduations. And Ms. Bass said the practice some Immigration and Customs Enforcement agents have adopted of obscuring their faces with black masks makes a menacing encounter even more frightening.\n“These masked men pull up in unmarked cars and jump out of the cars with rifles and detain people,” Ms. Bass said in a separate interview on Sunday on CBS. “For the average citizen, it looks like it’s a violent kidnapping. You should never have that.”\nEarlier this month, 14 Democratic senators said in a letter to Todd Lyons, the acting director of ICE, that agents grabbing people off the street while masked and in plain clothes “represents a clear attempt to compound” the “fear and chaos” of immigration raids and “avoid accountability for agents’ actions.” \nMr. Lyons said in an interview Sunday on CBS that he did not encourage agents to use masks but would continue to let them wear them in the field “if that’s a tool they need to keep them and their families safe.”\nFederal officials say the face coverings help protect ICE agents from being doxxed, or having personal details like a home address or contact information shared online.\nWe are having trouble retrieving the article content.\nPlease enable JavaScript in your browser settings.\nThank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or subscribe for all of The Times.\nThank you for your patience while we verify access.\nAlready a subscriber? Log in.\nWant all of The Times? Subscribe."}
{"title": "Monday Briefing: Dozens Killed in Gaza", "newspaper": "The New York Times", "url": "https://www.nytimes.com/2025/07/20/briefing/gaza-israel-japan-epstein-trump.html", "archive_url": "https://web.archive.org/web/20250721014606/https://www.nytimes.com/2025/07/20/briefing/gaza-israel-japan-epstein-trump.html", "publish_date": "2025-07-20T21:00:08Z", "writers": "By Justin Porter", "content": "Israeli forces yesterday killed and wounded dozens of Palestinians who were gathered in northern Gaza to receive aid from U.N. trucks entering the territory, the Gaza health ministry and health workers said.\nThe health ministry and a hospital director in Gaza City said that more than 60 people were killed in the attack, which took place near the Zikim crossing between the Gaza Strip and Israel. A nearby field hospital was flooded with victims, including more than 100 who were wounded.\nIsrael’s military said that its soldiers fired warning shots, and that they then opened fire to “remove an immediate threat,” which it did not specify. It also said the reported toll from the violence did “not align” with its review, and that it was continuing to examine the episode. \nThe U.N. World Food Program said that its convoy of 25 trucks carrying food for Palestinians was entering northern Gaza when it “encountered massive crowds of hungry civilians which came under gunfire.” \nChaos has dominated aid distribution in Gaza, where Palestinians are facing widespread hunger. Israeli soldiers have repeatedly opened fire near huge crowds of Palestinians desperate for food and other aid.\nEvacuations: After the shooting, the Israeli military warned Palestinians to leave the populated areas of northern Gaza and parts of Gaza City, describing them as “combat zones.” \nWe are having trouble retrieving the article content.\nPlease enable JavaScript in your browser settings.\nThank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or subscribe for all of The Times.\nThank you for your patience while we verify access.\nAlready a subscriber? Log in.\nWant all of The Times? Subscribe."}
{"title": "Mamdani Travels to Uganda in Break From Mayoral Campaign", "newspaper": "The New York Times", "url": "https://www.nytimes.com/2025/07/20/nyregion/zohran-mamdani-uganda-trip.html", "archive_url": "https://web.archive.org/web/20250721120342/https://www.nytimes.com/2025/07/20/nyregion/zohran-mamdani-uganda-trip.html", "publish_date": "2025-07-20T19:55:47Z", "writers": "By Ana Ley", "content": "Assemblyman Zohran Mamdani, the Democratic nominee for mayor of New York City, said on Sunday that he was visiting Uganda, where he was born, in a break from campaigning for the general election in November.\nIn a video posted on X and Bluesky, Mr. Mamdani said he was making the trip to Africa with his wife, Rama Duwaji, whom he married in February, to celebrate their marriage with family and friends.\nHe left the city during the traditional summer lull in the weeks after the June primary, while, at the same time, his most formidable opponent, former Gov. Andrew M. Cuomo, was seeking to strengthen his own run on an independent ballot line with appearances across New York in the aftermath of his surprise defeat by Mr. Mamdani.\nIn a statement, Mayor Eric Adams, a Democrat who is running for re-election as an independent, criticized his opponent for taking a vacation. (Mr. Adams has taken numerous trips abroad before and after becoming mayor, including a weeklong “spiritual journey” to Ghana shortly after his election in 2021.)\n“At a time when public safety, housing, and education remain top concerns for working New Yorkers, the mayor is here — managing the responsibilities of running the largest city in America,” Mr. Adams said in a prepared statement. “This election is about who’s prepared to lead, not who can rack up the most passport stamps or press headlines. Eric Adams is working. Others are sightseeing.”\nA spokesman for Mr. Cuomo did not immediately respond to a request for comment.\nMr. Mamdani’s spokesman, Jeffrey Lerner, said in a statement that the candidate would return to New York before the end of the month “and looks forward to resuming public events and continuing his campaign to make the most expensive city in America affordable.”\nWe are having trouble retrieving the article content.\nPlease enable JavaScript in your browser settings.\nThank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or subscribe for all of The Times.\nThank you for your patience while we verify access.\nAlready a subscriber? Log in.\nWant all of The Times? Subscribe."}
{"title": "Faint Signs of Life Appear in Effort to Halt Ukraine War", "newspaper": "The New York Times", "url": "https://www.nytimes.com/2025/07/20/world/europe/russia-ukraine-war-trump-peace-talks.html", "archive_url": "https://web.archive.org/web/20250721212258/https://www.nytimes.com/2025/07/20/world/europe/russia-ukraine-war-trump-peace-talks.html", "publish_date": "2025-07-20T19:15:43Z", "writers": "By Andrew E. Kramer", "content": "When Russian and Ukrainian peace negotiators met last month, they could agree on little more than exchanging bodies. Those negotiations, brokered by the Trump administration, appeared to show its goal of ending the war was deeply stalled.\nBut that doesn’t mean that the diplomatic entreaties don’t continue — with both Russia and Ukraine trying in their own ways to appeal to the White House.\nPresident Volodymyr Zelensky of Ukraine proposed over the weekend to revive the talks. It was his first offer for renewed negotiations since the Trump administration agreed to facilitate the transfer of air defense weapons to Ukraine and threatened to impose sanctions on Russia’s trading partners within 50 days — both steps intended to hasten negotiations.\nMr. Zelensky proposed talks on a cease-fire, prisoner exchanges and the return of Ukrainian children deported to Russia during the war. He reiterated an offer for a direct meeting with President Vladimir V. Putin of Russia, first floated in May. Mr. Putin had then remained silent for days before rejecting the offer.\n“The Russian side must stop hiding from decisions,” Mr. Zelensky said a video address Saturday evening. Ukraine, he said, has offered a meeting in the coming week in Istanbul, where two previous rounds of talks took place in May and June.\nMr. Zelensky said his national security adviser, Rustem Umerov, had conveyed the proposal to the Russian negotiating team.\nWe are having trouble retrieving the article content.\nPlease enable JavaScript in your browser settings.\nThank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or subscribe for all of The Times.\nThank you for your patience while we verify access.\nAlready a subscriber? Log in.\nWant all of The Times? Subscribe."}
{"title": "Jean-Pierre Azéma, 87, Dies; Chronicled French Collaboration With Nazis", "newspaper": "The New York Times", "url": "https://www.nytimes.com/2025/07/20/world/europe/jean-pierre-azema-dead.html", "archive_url": "https://web.archive.org/web/20250721212501/https://www.nytimes.com/2025/07/20/world/europe/jean-pierre-azema-dead.html", "publish_date": "2025-07-20T19:05:32Z", "writers": "By Adam Nossiter", "content": "Jean-Pierre Azéma, a historian who became a leading chronicler of France’s dark days of wartime compromise, helping lead a generation’s shift in attitude about that period though he himself was the son of a notorious collaborator with the Nazis, died on July 14 in Paris. He was 87.\nHis death, in a hospice, was announced by the university where he taught for more than 35 years, the Institut d’Études Politiques, popularly known as Sciences Po.\nWith a series of dispassionate, carefully researched books beginning in the 1970s, Mr. Azéma became part of a group of younger historians who helped destroy the postwar myths that France had comforted itself with: that the collaborationist wartime Vichy regime had done what it could to resist the occupying Germans and to protect the French, and that its leader, Marshal Philippe Pétain, was essentially benevolent.\nMr. Azéma was having none of it.\n“A phony regime” is what he called Pétain’s government in his best-known work, “De Munich à la Libération, 1938-1944” (1979, and translated in 1984 as “From Munich to the Liberation”). He condemned the government for its “sententious moralism and anti-democratic élitism” and its “defensive and inward-looking nationalism.”\nVichy was “basically authoritarian,” Mr. Azéma wrote, a careful judgment not then universally accepted. He became known for picking apart Vichy’s various factions — from the believers in Pétain’s cult to the opportunists, and from those who believed in the marshal’s project of a “National Revolution” to those who were pro-Nazi.\nIn France, Mr. Azéma’s book outsold even the groundbreaking work of his friend the Columbia historian Robert O. Paxton, “Vichy France,” which Mr. Azéma’s mother, Claude Bertrand, had translated into French six years before and which was the first to set off the revisionist tide.\nWe are having trouble retrieving the article content.\nPlease enable JavaScript in your browser settings.\nThank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or subscribe for all of The Times.\nThank you for your patience while we verify access.\nAlready a subscriber? Log in.\nWant all of The Times? Subscribe."}
{"title": "Republicans and Democrats Call for More Information on Epstein Case", "newspaper": "The New York Times", "url": "https://www.nytimes.com/2025/07/20/us/politics/trump-epstein-files.html", "archive_url": "https://web.archive.org/web/20250721005404/https://www.nytimes.com/2025/07/20/us/politics/trump-epstein-files.html", "publish_date": "2025-07-20T18:26:44Z", "writers": "By Michael Gold", "content": "Days after the Justice Department asked a federal judge to unseal grand jury testimony related to the disgraced financier Jeffrey Epstein, Republicans and Democrats suggested on Sunday that the move was insufficient and called for the release of more information.\n“I think it’s a good start,” Representative Tim Burchett, Republican of Tennessee, said in an interview on CNN. But he still wanted to see as many files as possible released, he added later.\nPresident Trump has been contending with fierce criticism from some of his supporters over his administration’s handling of materials related to the sex trafficking investigations of Mr. Epstein and his connections to rich and powerful figures on the left and right. Mr. Epstein died by suicide in 2019 while in federal prison awaiting trial on sex-trafficking charges.\nMr. Trump and many of his allies vowed to release a trove of files in the case, including a so-called “client list” that many involved in the case insist never existed. But the release of some documents earlier this year offered no new revelations. And the Justice Department said this month that it had closed the case and would not release more documents, concluding that there was no client list.\nOne of Mr. Epstein’s former lawyers, Alan Dershowitz, said in an interview on “Fox News Sunday” that the grand jury testimony was unlikely to contain the information that has most interested Mr. Trump’s supporters.\nMr. Trump has encouraged his base to move on. But the backlash seemed to be on his mind on Sunday morning, when he accused “Radical Left Democrats” of exposing the “Jeffrey Epstein Hoax.”\nWe are having trouble retrieving the article content.\nPlease enable JavaScript in your browser settings.\nThank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or subscribe for all of The Times.\nThank you for your patience while we verify access.\nAlready a subscriber? Log in.\nWant all of The Times? Subscribe."}
{"title": "Jake Larson, D-Day Veteran and TikTok Star, Dies at 102", "newspaper": "The New York Times", "url": "https://www.nytimes.com/2025/07/20/us/papa-jake-larson-dies-ww2.html", "archive_url": "https://web.archive.org/web/20250721174133/https://www.nytimes.com/2025/07/20/us/papa-jake-larson-dies-ww2.html", "publish_date": "2025-07-20T18:15:20Z", "writers": "By Adeel Hassan", "content": "Jake Larson, who was part of a unit that stormed Omaha Beach on D-Day in 1944 and who gained a wide following on social media after sharing his memories of World War II, died on Thursday at his home in the San Francisco Bay Area. He was 102.\nHis death was confirmed by his granddaughter McKaela Larson, on his social media accounts.\nMr. Larson had 1.2 million followers on TikTok on his channel, “Story Time with Papa Jake.” He amassed more than 11 million likes on the page.\n“He went peacefully and was even cracking jokes til the very end,” Ms. Larson posted. “As Papa would say, ‘Love you all the mostest.’” Information about his other survivors was not immediately available.\nStaff Sgt. Larson was among the 160,000 Allied troops who swarmed onto the beaches of Normandy, France, on June 6, 1944, in an invasion that would ultimately lead to the liberation of Europe from the Nazis.\nWe are having trouble retrieving the article content.\nPlease enable JavaScript in your browser settings.\nThank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or subscribe for all of The Times.\nThank you for your patience while we verify access.\nAlready a subscriber? Log in.\nWant all of The Times? Subscribe."}
{"title": "In Nashville, a Homecoming for Dolly Parton and Her Musical", "newspaper": "The New York Times", "url": "https://www.nytimes.com/2025/07/20/theater/dolly-parton-musical-nashville.html", "archive_url": "https://web.archive.org/web/20250721181954/https://www.nytimes.com/2025/07/20/theater/dolly-parton-musical-nashville.html", "publish_date": "2025-07-20T17:52:51Z", "writers": "By Emily Cochrane", "content": "They came from across the country and drove in from the rest of Tennessee on Friday, braving the steamy heat of Nashville after a summer storm in sparkling boots, sequined jackets and butterfly accessories. There was even a blonde wig or two, piled high.\nIt was fitting for the first public performance of the musical biography of the woman Tennessee proudly claims as one of its own: Dolly Parton.\n“She wanted her people to see it,” said Kim Mynatt, 61, of Murfreesboro, Tenn., the first in line with her husband at least two hours before the curtain rose at the Fisher Center for the Performing Arts on Friday. “That’s one of the things I love about her.”\nNashville, of course, has its own Broadway: the downtown strip of honky-tonks and performance venues that has cultivated generations of musical talent. Yet it is an unusual place for a theater production, already aiming for a 2026 opening on Broadway in New York, to hold its world premiere.\nUnless, of course, that show is the story of Dolly Parton.\n“Dolly’s what got me here,” said Mynatt, who wore a 1989 Dollywood seasonal shirt — one of at least 30 Parton-themed shirts she owns — and one of Parton’s official pink butterfly statement necklaces. “The woman has never disappointed.”\nFew artists have nurtured such a deeply personal relationship with their home state — or attained such levels of mythology. Her fingerprints are across Tennessee, from her anthems to her Dollywood theme park in Pigeon Forge to the money she poured into sending free books to children, coronavirus vaccine research at Vanderbilt University Medical Center and wildfire recovery in Gatlinburg.\n“Dolly: A True Original Musical” was now just a new, intriguing stop on the well-worn Dolly pilgrimage between East Tennessee and Nashville.\nThat preview quickly sold out at the Fisher Center on the campus of Belmont University, a private Christian university in Nashville. With a formal opening night set for Aug. 8, it has already extended its run to Aug. 31.\n“We eat, breathe and live Dolly Parton,” said Jasmine Peterson, 28, who drove with her daughter, Mallory, 7, from the small town of Erwin in East Tennessee. Peterson said the way Parton grew up, in a one-room cabin without electricity or running water, resembled her grandparents’ lives, which made the successes documented in the musical all the more meaningful.\n“She is the queen of Tennessee,” added Jessup Peterson, Ms. Peterson’s brother, who drove in from New Orleans to see the show with his siblings. “Any opportunity we get to see her is important to us.”\nParton — always Dolly here in Tennessee — and her music have now been shared over generations, particularly among women who found comfort and encouragement in her glamour, her faith and her principled ideals.\n“I grew up with a grandmother that said, ‘There’s country and there’s Dolly,’” said Aundria Littlejohn, 28, who flew in from New York. “She’s always inspired this authenticity in myself, just to live it without having to say it.”\nAnd with this preview performance kicking off “a full Dolly weekend,” she added, “I get to really dive into my obsession for a whole weekend.”\nPart of the lobby had been transformed with similar obsessions in mind. A combined shop and display of Parton’s career and business empire, all behind a cabin entrance that nodded to her home in the mountains, was a prime attraction.\nFor the youngest attendees, there was an area dedicated to the Imagination Library, where children could draw and scrawl on butterfly sticky notes. Some of her performance outfits and costumes were on display, alongside life-size cutouts of Parton. There were buckets of pink and yellow roses that could be bought and assembled at the Bouquet Box Flower Bar.\nAnd there was the merchandise, staggering in its scope: clothing, books, wine, skillets, buttermilk biscuit mix, just to name a few. (There are always more Dolly items to be purchased, fans agreed, beyond what had already been curated at home.)\nA security guard, watching merchandise lines snake through, could be heard marveling at the enthusiasm. He should, he admitted, do a deeper dive himself into the Dolly lore.\n“I don’t think people outside of Tennessee understand how important she is to East Tennessee,” said Kristi Watkins, 44, a catering manager in Knoxville, who recounted her time spent at Dollywood. “She’s never forgotten where she’s come from.”\nWatkins and two friends, Julie Cuffman, 43, and Ashleigh Scott, 38, were among those not necessarily expecting to learn anything new from the show. Among the many scholars of Parton’s well-told story of her upbringing and success, it would be a surprise, they said, to uncover new revelations.\nBut it was a chance, fans said, to have a few more intimate glimpses into Parton’s mind and memories. At least one aspect has proved to be more poignant: Carl Dean, a constant, though deeply private, presence in Parton’s life over nearly six decades of marriage, died in March.\n“This is a way for us to connect those moments that she’s been telling us about this whole time, but we didn’t see them,” said Kayleigh Mollycheck, a performer and marketing professional, who hand-bedazzled an “In Dolly We Trust” jacket for the occasion and carried a pink guitar purse.\nShe was among those who said part of the appeal of the first preview was the fact that the production was still making changes, as is common during previews, especially for out-of-state tryouts. (The director, Bartlett Sher, told the crowd before the show’s start that it was their third full run-through. Some in the audience already had plans to see it at least one more time.)\n“I feel like I’m part of the creative process tonight because it’s going to morph and change and grow and breathe,” said Nathaniel Knepper-Quijano, an artistic director in Cocoa Village, Fla.”\nThere was also no doubt that there was a thrill in hearing new Dolly music publicly for the first time — even if Parton wasn’t singing it herself. In a list of frequently asked questions, the musical reminds audiences that Parton will not be performing.\n“We need more — you can’t ever have enough Dolly,” said Dalton King, 27, who lives in Clairfield in northeastern Tennessee. To see the musical debut in Nashville, he said, “goes full circle.”\nAnd, of course, there was one other reason to be there for the first preview.\n“What’s our theory on her being here?” one woman, in silver-bowed heels, asked those in line around her.\nThe answer was obvious when, right as the show was set to begin, the crowd roared and jumped to its feet. Outside the auditorium, a few theater staff members quickly gathered around a television, where a feed showed Parton onstage, beaming and shimmering in a sequined gold top, pants and heels.\n“I want you to know that we’re so happy that we get to do this here in my hometown, here in Nashville,” Parton said, as she praised the musical’s team and warned the audience against singing along. (“This ain’t no hootenanny,” she said to laughter.)\n“You know I love you and appreciate you,” she concluded. “I’m going to share my life story with you.”"}
